app/Models/Transaksi/PerpalModel.php

    public function get_all_perpal()
    {
        // Query untuk mengambil semua data dari tabel 'perpal'
        $query = $this->db->table($this->table)->get();

        // Mengembalikan hasil query sebagai array dari baris-baris yang ditemukan
        return $query->getResultArray();
---
SELECT *
FROM `perpal`