app/Controllers/Transaksi/Perpal.php

SELECT *
FROM `supir`
---
    public function index(): string
    {
        // Mengambil data dari model PerpalModel
        $data['perpal_list'] = $this->perpal->get_all_perpal();

        // Mengambil data crew
        $data['crew_list'] = $this->perpal->getCrewData();

        // Mengambil data supir dari SupirModel
        $supirModel = new SupirModel();
        $data['supir_list'] = $supirModel->findAll();

SELECT *
FROM `supir`
WHERE `kode_karyawan` = 'KBC0023'
 LIMIT 1
---
    public function get_driver_details()
    {
        $kode_supir = $this->request->getPost('kode_supir'); // Ambil kode_supir dari parameter GET
        // dd($kode_supir);

        // Panggil model atau data layer Anda untuk mendapatkan detail supir berdasarkan kode_supir
        // $driver_details = $this->perpal->getDriverDetails($kode_supir);
        $model = new SupirModel();
        $supir = $model->where('kode_karyawan', $kode_supir)->first();

INSERT INTO `perpal` (`no_transaksi`, `tanggal`, `nama`, `jlh_hari_perpal`, `lokasi`, `keterangan`, `total_`, `hasil_perhitungan_`, `created_at`, `created_by`) VALUES ('PP-24070001', '2024-07-15', 'MARMOYO', '5', 'testa', 'tester', '10', '50', '2024-07-15 10:41:26', 21)
---
    public function create()
    {
        $userData = auth()->user();
        if (($userData->role == 1) || (in_array('create_transaksi_perpal', json_decode($userData->access)))) {

            $header['no_transaksi'] = $_REQUEST['no_transaksi'];
            $header['tanggal'] = date('Y-m-d', strtotime($_REQUEST['tanggal']));
            $header['jabatan'] = $_REQUEST['jabatan'];
            $header['nama'] = $_REQUEST['nama'];
            $header['jlh_hari_perpal'] = $_REQUEST['jlh_hari_perpal'];
            $header['lokasi'] = $_REQUEST['lokasi'];
            $header['keterangan'] = $_REQUEST['keterangan'];
            $header['total_'] = $_REQUEST['total_']; // Include the calculation result
            $header['hasil_perhitungan_'] = $_REQUEST['hasil_perhitungan_']; // Include the calculation result
            $header['created_at'] = date('Y-m-d H:i:s');
            $header['created_by'] = $userData->id;

            $insert = $this->perpal->insert($header);